nxp-mcuxpresso/mcux-component/power_manager/devices/MCXN236/fsl_pm_device.c
/*
 * Copyright 2024 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_pm_device.h"
#include "fsl_pm_core.h"
#include "fsl_pm_device_config.h"
#include "fsl_cmc.h"
#include "fsl_spc.h"
#include "fsl_wuu.h"
#include "fsl_clock.h"
#include "fsl_vbat.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*******************************************************************************
 * Macros
 ******************************************************************************/

/*******************************************************************************
 * Prototypes
 ******************************************************************************/
typedef struct _resource_recode resource_recode_t;
static uint8_t g_nextPowerMode;

static void EnterLowPowerMode(uint8_t stateIndex, pm_resc_mask_t *pSoftRescMask, pm_resc_group_t *pSysRescGroup);
static void CleanExitLowPowerMode(void);

static void SetSystemPeripheralPowerMode(uint8_t operateMode, resource_recode_t *pResourceRecode);
static void SetVoltagePeripheralPowerMode(uint8_t operateMode, resource_recode_t *pResourceRecode);
static void SetSramPowerMode(uint8_t operateMode, resource_recode_t *pResourceRecode);

#if (defined(FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER) && FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER)
static status_t ManageWakeupSource(pm_wakeup_source_t *ws, bool enable);
#endif /* FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER */

/*******************************************************************************
 * Variables
 ******************************************************************************/
AT_ALWAYS_ON_DATA_INIT(cmc_power_domain_config_t g_powerDomainConfig) = {
    .clock_mode = kCMC_GateNoneClock,
    .main_domain = kCMC_ActiveOrSleepMode,
    .wake_domain = kCMC_ActiveOrSleepMode,
};

pm_device_option_t g_devicePMOption = {
    .states =
        {
            /* Sleep */
            {
                .exitLatency = 1U,
            },
            /* Deep Sleep */
            {
                .exitLatency = 9U,
            },
            /* Power Down */
            {
                .exitLatency = 10U,
            },
            /* Deep Power Down */
            {
                .exitLatency = 5600U,
            },
        },
    .stateCount = PM_LP_STATE_COUNT,
    .enter      = EnterLowPowerMode,
    .clean      = CleanExitLowPowerMode,

#if (defined(FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER) && FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER)
    .manageWakeupSource = ManageWakeupSource,
#endif /* FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER */
};

struct _resource_recode
{
    uint8_t currentMode : 4U;
    void (*resourceConfigFunc)(uint8_t operateMode, resource_recode_t *pResourceRecode);
};

uint8_t rescArray[PM_CONSTRAINT_COUNT][kResc_PowerMode_Max] = {
    /* System modules */
    [kResc_CodeCache] = {KReac_Status_Hold, KReac_Status_Hold, KReac_Status_Hold, kResc_Status_Off},
    [kResc_Fro_180M]  = {kResc_Status_On,   kResc_Status_On,   kResc_Status_Off,  kResc_Status_Off},
    [kResc_Fro_12M]   = {kResc_Status_On,   kResc_Status_On,   kResc_Status_On,   kResc_Status_Off},
    [kResc_Fro_16K]   = {kResc_Status_On,   kResc_Status_On,   kResc_Status_On,   kResc_Status_On},
    [kResc_Osc_Rtc]   = {kResc_Status_On,   kResc_Status_On,   kResc_Status_On,   kResc_Status_On},
    [kResc_Osc_Sys]   = {kResc_Status_On,   kResc_Status_On,   kResc_Status_Off,  kResc_Status_Off},
    [kResc_Apll]      = {kResc_Status_On,   kResc_Status_On,   kResc_Status_Off,  kResc_Status_Off},
    [kResc_Spll]      = {kResc_Status_On,   kResc_Status_On,   kResc_Status_Off,  kResc_Status_Off},

    /* Power domain modules */
    [kResc_LdoCore]          = {kResc_Status_On,  kResc_Status_On, kResc_Status_On, kResc_Status_Off},
    [kResc_RamRetentionLdo]  = {kResc_Status_On,  kResc_Status_On, kResc_Status_On, kResc_Status_On},
    [kResc_Core_Vdd_Ivs]     = {kResc_Status_Off, kResc_Status_On, kResc_Status_On, kResc_Status_Off},
    [kResc_Core_Vdd_Lvd_Act] = {kResc_Status_On,  kResc_Status_On, kResc_Status_On, kResc_Status_Off},
    [kResc_Core_Vdd_Hvd_Act] = {kResc_Status_On,  kResc_Status_On, kResc_Status_On, kResc_Status_Off},
    [kResc_Sys_Vdd_Lvd_Act]  = {kResc_Status_On,  kResc_Status_On, kResc_Status_On, kResc_Status_On},
    [kResc_Sys_Vdd_Hvd_Act]  = {kResc_Status_On,  kResc_Status_On, kResc_Status_On, kResc_Status_On},
    [kResc_Io_Vdd_Lvd_Act]   = {kResc_Status_On,  kResc_Status_On, kResc_Status_On, kResc_Status_Off},
    [kResc_Io_Vdd_Hvd_Act]   = {kResc_Status_On,  kResc_Status_On, kResc_Status_On, kResc_Status_Off},
    [kResc_Core_Vdd_Lvd_Lp]  = {kResc_Status_On,  kResc_Status_On, kResc_Status_On, kResc_Status_Off},
    [kResc_Core_Vdd_Hvd_Lp]  = {kResc_Status_On,  kResc_Status_On, kResc_Status_On, kResc_Status_Off},
    [kResc_Sys_Vdd_Lvd_Lp]   = {kResc_Status_On,  kResc_Status_On, kResc_Status_On, kResc_Status_On},
    [kResc_Sys_Vdd_Hvd_Lp]   = {kResc_Status_On,  kResc_Status_On, kResc_Status_On, kResc_Status_On},
    [kResc_Io_Vdd_Lvd_Lp]    = {kResc_Status_On,  kResc_Status_On, kResc_Status_On, kResc_Status_Off},
    [kResc_Io_Vdd_Hvd_Lp]    = {kResc_Status_On,  kResc_Status_On, kResc_Status_On, kResc_Status_Off},

    /* SRAM modules */
    [kResc_RamA0] = {kResc_Status_On, KReac_Status_Hold, KReac_Status_Hold, KReac_Status_Hold},
    [kResc_RamA1] = {kResc_Status_On, KReac_Status_Hold, KReac_Status_Hold, KReac_Status_Hold},
    [kResc_RamA2] = {kResc_Status_On, KReac_Status_Hold, KReac_Status_Hold, KReac_Status_Hold},
    [kResc_RamA3] = {kResc_Status_On, KReac_Status_Hold, KReac_Status_Hold, KReac_Status_Hold},
    [kResc_RamX0] = {kResc_Status_On, KReac_Status_Hold, KReac_Status_Hold, kResc_Status_Off},
    [kResc_RamX1] = {kResc_Status_On, KReac_Status_Hold, KReac_Status_Hold, kResc_Status_Off},
    [kResc_RamX2] = {kResc_Status_On, KReac_Status_Hold, KReac_Status_Hold, kResc_Status_Off},
    [kResc_RamB0] = {kResc_Status_On, KReac_Status_Hold, KReac_Status_Hold, kResc_Status_Off},
    [kResc_RamC0] = {kResc_Status_On, KReac_Status_Hold, KReac_Status_Hold, kResc_Status_Off},
    [kResc_RamC1] = {kResc_Status_On, KReac_Status_Hold, KReac_Status_Hold, kResc_Status_Off},
    [kResc_RamD0] = {kResc_Status_On, KReac_Status_Hold, KReac_Status_Hold, kResc_Status_Off},
    [kResc_RamD1] = {kResc_Status_On, KReac_Status_Hold, KReac_Status_Hold, kResc_Status_Off},
    [kResc_RamE0] = {kResc_Status_On, KReac_Status_Hold, KReac_Status_Hold, kResc_Status_Off},
    [kResc_RamE1] = {kResc_Status_On, KReac_Status_Hold, KReac_Status_Hold, kResc_Status_Off},
};

AT_ALWAYS_ON_DATA_INIT(resource_recode_t resourceDB[kResc_Max_Num]) = {
    /* System modules */
    [kResc_CodeCache] = {PM_RESOURCE_FULL_ON, SetSystemPeripheralPowerMode},
    [kResc_Fro_180M]  = {PM_RESOURCE_FULL_ON, SetSystemPeripheralPowerMode},
    [kResc_Fro_12M]   = {PM_RESOURCE_FULL_ON, SetSystemPeripheralPowerMode},
    [kResc_Fro_16K]   = {PM_RESOURCE_OFF, SetSystemPeripheralPowerMode},
    [kResc_Osc_Rtc]   = {PM_RESOURCE_OFF, SetSystemPeripheralPowerMode},
    [kResc_Osc_Sys]   = {PM_RESOURCE_OFF, SetSystemPeripheralPowerMode},
    [kResc_Apll]      = {PM_RESOURCE_OFF, SetSystemPeripheralPowerMode},
    [kResc_Spll]      = {PM_RESOURCE_OFF, SetSystemPeripheralPowerMode},

    /* Power domain modules */
    [kResc_LdoCore]          = {PM_RESOURCE_FULL_ON, SetVoltagePeripheralPowerMode},
    [kResc_RamRetentionLdo]  = {PM_RESOURCE_FULL_ON, SetVoltagePeripheralPowerMode},
    [kResc_Core_Vdd_Ivs]     = {PM_RESOURCE_FULL_ON, SetVoltagePeripheralPowerMode},
    [kResc_Core_Vdd_Lvd_Act] = {PM_RESOURCE_FULL_ON, SetVoltagePeripheralPowerMode},
    [kResc_Core_Vdd_Hvd_Act] = {PM_RESOURCE_FULL_ON, SetVoltagePeripheralPowerMode},
    [kResc_Sys_Vdd_Lvd_Act]  = {PM_RESOURCE_FULL_ON, SetVoltagePeripheralPowerMode},
    [kResc_Sys_Vdd_Hvd_Act]  = {PM_RESOURCE_FULL_ON, SetVoltagePeripheralPowerMode},
    [kResc_Io_Vdd_Lvd_Act]   = {PM_RESOURCE_FULL_ON, SetVoltagePeripheralPowerMode},
    [kResc_Io_Vdd_Hvd_Act]   = {PM_RESOURCE_FULL_ON, SetVoltagePeripheralPowerMode},
    [kResc_Core_Vdd_Lvd_Lp]  = {PM_RESOURCE_OFF, SetVoltagePeripheralPowerMode},
    [kResc_Core_Vdd_Hvd_Lp]  = {PM_RESOURCE_OFF, SetVoltagePeripheralPowerMode},
    [kResc_Sys_Vdd_Lvd_Lp]   = {PM_RESOURCE_OFF, SetVoltagePeripheralPowerMode},
    [kResc_Sys_Vdd_Hvd_Lp]   = {PM_RESOURCE_OFF, SetVoltagePeripheralPowerMode},
    [kResc_Io_Vdd_Lvd_Lp]    = {PM_RESOURCE_OFF, SetVoltagePeripheralPowerMode},
    [kResc_Io_Vdd_Hvd_Lp]    = {PM_RESOURCE_OFF, SetVoltagePeripheralPowerMode},

