nxp-mcuxpresso/mcux-component/power_manager/devices/MCXN236/fsl_pm_device.c
    /* SRAM modules */
    [kResc_RamA0] = {PM_RESOURCE_FULL_ON, SetSramPowerMode},
    [kResc_RamA1] = {PM_RESOURCE_FULL_ON, SetSramPowerMode},
    [kResc_RamA2] = {PM_RESOURCE_FULL_ON, SetSramPowerMode},
    [kResc_RamA3] = {PM_RESOURCE_FULL_ON, SetSramPowerMode},
    [kResc_RamX0] = {PM_RESOURCE_FULL_ON, SetSramPowerMode},
    [kResc_RamX1] = {PM_RESOURCE_FULL_ON, SetSramPowerMode},
    [kResc_RamX2] = {PM_RESOURCE_FULL_ON, SetSramPowerMode},
    [kResc_RamB0] = {PM_RESOURCE_FULL_ON, SetSramPowerMode},
    [kResc_RamC0] = {PM_RESOURCE_FULL_ON, SetSramPowerMode},
    [kResc_RamC1] = {PM_RESOURCE_FULL_ON, SetSramPowerMode},
    [kResc_RamD0] = {PM_RESOURCE_FULL_ON, SetSramPowerMode},
    [kResc_RamD1] = {PM_RESOURCE_FULL_ON, SetSramPowerMode},
    [kResc_RamE0] = {PM_RESOURCE_FULL_ON, SetSramPowerMode},
    [kResc_RamE1] = {PM_RESOURCE_FULL_ON, SetSramPowerMode},
};

/*******************************************************************************
 * Code
 ******************************************************************************/
void ConstructResourceInformation(uint8_t rescArray[][kResc_PowerMode_Max])
{
    for (uint8_t resc = 0U; resc < kResc_Max_Num; resc++)
    {
        for (uint8_t mod = 0U; mod < kResc_PowerMode_Max; ++mod)
        {
            g_devicePMOption.states[mod].varConstraintsMask.rescMask[resc / 32U] &= ~(1UL << (resc % 32U));
            g_devicePMOption.states[mod].fixConstraintsMask.rescMask[resc / 32U] |= (1UL << (resc % 32U));

            if (rescArray[resc][mod] != kResc_Status_Off)
            {
                g_devicePMOption.states[mod].varConstraintsMask.rescMask[resc / 32U] |= (1UL << (resc % 32U));
                g_devicePMOption.states[mod].fixConstraintsMask.rescMask[resc / 32U] &= ~(1UL << (resc % 32U));
            }
        }
    }
}

static void ControlResources(pm_resc_mask_t *pSoftRescMask, pm_resc_group_t *pSysRescGroup)
{
    assert(pSoftRescMask);
    assert(pSysRescGroup);

    uint8_t opMode = 0U;

    for (uint32_t i = 0UL; i < (uint32_t)PM_CONSTRAINT_COUNT; i++)
    {
        if (resourceDB[i].resourceConfigFunc != NULL)
        {
            opMode = (uint8_t)(uint32_t)(PM_RESC_GROUP(pSysRescGroup, i));
            if (opMode != resourceDB[i].currentMode)
            {
                resourceDB[i].resourceConfigFunc(opMode, &resourceDB[i]);
            }
        }
    }
}

/*! Notes: 
 * 1. If the DCDC_VDD_LVL is not 00b, the CORE_LDO_VDD_LVL must set to the same 
 *      value as DCDC_VDD_LVL, even the LDO_CORE is off.
 * 2. If the DCDC_VDD_LVL is 00b, the CORE_LDO_VDD_LVL can be different with 
 *      DCDC_VDD_LVL, and the VDD_CORE_LVD must disabled.
 * 3. Require BG enabled
 *      1. Set CORELDO_VDD_DS/SYSLDO_VDD_DS/DCDC_VDD_DS to normal.
 *      2. VDD_CORE glitch enabled.
 *      3. Any HVDs/LVDs enabled
 * 4. Set CORELDO_VDD_DS/SYSLDO_VDD_DS to low requires LVDs/HVDs disabled.
 * 5. If the CORE_LDO_VDD_DS is set to the same value in both AC and LP mode,
 *      the CORE_LDO_VDD_LVL must set to the same voltage level.
 * 6. CORE_LDO_VDD_LVL can be changed only when AC mode CORE_LDO_VDD_DS=1
*/
static void EnterLowPowerMode(uint8_t stateIndex, pm_resc_mask_t *pSoftRescMask, pm_resc_group_t *pSysRescGroup)
{
    assert(pSoftRescMask);
    assert(pSysRescGroup);

    g_nextPowerMode = stateIndex;

    ControlResources(pSoftRescMask, pSysRescGroup);

    switch (stateIndex)
    {
        case PM_LP_STATE_SLEEP:
        {
            g_powerDomainConfig.clock_mode  = kCMC_GateCoreClock;
            g_powerDomainConfig.main_domain = kCMC_ActiveOrSleepMode;
            g_powerDomainConfig.wake_domain = kCMC_ActiveOrSleepMode;

            SPC_SetLowPowerModeBandgapmodeConfig(SPC0, kSPC_BandgapEnabledBufferDisabled);
            spc_lowpower_mode_dcdc_option_t dcdcOpt = {
              .DCDCVoltage       = kSPC_DCDC_MidVoltage,
              .DCDCDriveStrength = kSPC_DCDC_NormalDriveStrength, /* requires BG enabled. */
            };
            SPC_SetLowPowerModeDCDCRegulatorConfig(SPC0, &dcdcOpt);

            break;
        }
        case PM_LP_STATE_DEEP_SLEEP:
        {
            g_powerDomainConfig.clock_mode  = kCMC_GateAllSystemClocksEnterLowPowerMode;
            g_powerDomainConfig.main_domain = kCMC_DeepSleepMode;
            g_powerDomainConfig.wake_domain = kCMC_DeepSleepMode;
            CMC_SetPowerModeProtection(CMC0, (uint32_t)kCMC_AllowDeepSleepMode);
            
            spc_lowpower_mode_dcdc_option_t dcdcOpt = {
              .DCDCVoltage       = kSPC_DCDC_MidVoltage,
              .DCDCDriveStrength = kSPC_DCDC_LowDriveStrength,
            };
            SPC_SetLowPowerModeDCDCRegulatorConfig(SPC0, &dcdcOpt);
            
            break;
        }
        case PM_LP_STATE_POWER_DOWN:
        {
            g_powerDomainConfig.clock_mode  = kCMC_GateAllSystemClocksEnterLowPowerMode;
            g_powerDomainConfig.main_domain = kCMC_PowerDownMode;
            g_powerDomainConfig.wake_domain = kCMC_PowerDownMode;
            CMC_SetPowerModeProtection(CMC0, (uint32_t)kCMC_AllowPowerDownMode);
            
            spc_lowpower_mode_dcdc_option_t dcdcOpt = {
              .DCDCVoltage       = kSPC_DCDC_RetentionVoltage,
              .DCDCDriveStrength = kSPC_DCDC_LowDriveStrength,
            };
            SPC_SetLowPowerModeDCDCRegulatorConfig(SPC0, &dcdcOpt);

            SPC_SetLowPowerWakeUpDelay(SPC0, 0x3BBU);
            
            break;
        }
        case PM_LP_STATE_DEEP_POWER_DOWN:
        {
            g_powerDomainConfig.clock_mode  = kCMC_GateAllSystemClocksEnterLowPowerMode;
            g_powerDomainConfig.main_domain = kCMC_DeepPowerDown;
            g_powerDomainConfig.wake_domain = kCMC_DeepPowerDown;
            CMC_SetPowerModeProtection(CMC0, (uint32_t)kCMC_AllowDeepPowerDownMode);
            
            spc_lowpower_mode_dcdc_option_t dcdcOpt = {
              .DCDCVoltage       = kSPC_DCDC_MidVoltage,
              .DCDCDriveStrength = kSPC_DCDC_LowDriveStrength,
            };
            SPC_SetLowPowerModeDCDCRegulatorConfig(SPC0, &dcdcOpt);

            SPC_SetLowPowerWakeUpDelay(SPC0, 0x3BBU);
            break;
        }
        default:
        {
            assert(0);
            break;
        }
    }

    CMC_EnterLowPowerMode(CMC0, &g_powerDomainConfig);
}

static void CleanExitLowPowerMode(void)
{
    if ((SPC_CheckPowerDomainLowPowerRequest(SPC0, kSPC_PowerDomain0) == true) &&
        (SPC_GetPowerDomainLowPowerMode(SPC0, kSPC_PowerDomain0) >= kSPC_PowerDownWithSysClockOff))
    {
        SPC_ClearPeriphIOIsolationFlag(SPC0);
    }

    SPC_ClearPowerDomainLowPowerRequestFlag(SPC0, kSPC_PowerDomain0);
    SPC_ClearPowerDomainLowPowerRequestFlag(SPC0, kSPC_PowerDomain1);
    SPC_ClearLowPowerRequest(SPC0);

    /* LVDs/HVDs should be enabled in active mode */
    SPC_EnableActiveModeCoreLowVoltageDetect(SPC0, true);
    SPC_EnableActiveModeCoreHighVoltageDetect(SPC0, true);
    SPC_EnableActiveModeSystemLowVoltageDetect(SPC0, true);
    SPC_EnableActiveModeSystemHighVoltageDetect(SPC0, true);
    SPC_EnableActiveModeIOLowVoltageDetect(SPC0, true);
    SPC_EnableActiveModeIOHighVoltageDetect(SPC0, true);

    /* LVDs/HVDs should be disabled in low power mode */
    SPC_EnableLowPowerModeCoreLowVoltageDetect(SPC0, false);
    SPC_EnableLowPowerModeCoreHighVoltageDetect(SPC0, false);
    SPC_EnableLowPowerModeSystemLowVoltageDetect(SPC0, false);
    SPC_EnableLowPowerModeSystemHighVoltageDetect(SPC0, false);
    SPC_EnableLowPowerModeIOLowVoltageDetect(SPC0, false);
    SPC_EnableLowPowerModeIOHighVoltageDetect(SPC0, false);

    /* DCDC vl is mid, ds is low in low power mode */
    spc_lowpower_mode_dcdc_option_t dcdcOpt = {
        .DCDCVoltage       = kSPC_DCDC_MidVoltage,      /* same to the core ldo lvl */
        .DCDCDriveStrength = kSPC_DCDC_LowDriveStrength,        /* requires LVDs/HVDs disabled. */
    };
    SPC_SetLowPowerModeDCDCRegulatorConfig(SPC0, &dcdcOpt);
    
    /* core ldo vl to mid, ds is low in low power mode. */
    spc_lowpower_mode_core_ldo_option_t coreLdoOpt = {
        .CoreLDOVoltage = kSPC_CoreLDO_MidDriveVoltage, /* same to the dcdc lvl */
        .CoreLDODriveStrength = kSPC_CoreLDO_LowDriveStrength, /* requires LVDs/HVDs disabled. */
    };
    SPC_SetLowPowerModeCoreLDORegulatorConfig(SPC0, &coreLdoOpt);

    /* Set sys ldo ds to low in low power mode, this operation requires the LVDs/HVDs disabled. */
    SPC_SetLowPowerModeSystemLDORegulatorDriveStrength(SPC0, kSPC_SysLDO_LowDriveStrength);

    /* Dsiable core_vdd IVS in low power mode. */
    SPC_EnableLowPowerModeCoreVDDInternalVoltageScaling(SPC0, false);

    /* Bandgap should be disabled in low power mode */
    SPC_SetLowPowerModeBandgapmodeConfig(SPC0, kSPC_BandgapDisabled);
}

static void SetSystemPeripheralPowerMode(uint8_t operateMode, resource_recode_t *pResourceRecode)
{
    assert(pResourceRecode);

