nxp-mcuxpresso/mcux-component/power_manager/devices/MCXN236/fsl_pm_device.c
    uint8_t peripheralId = (uint8_t)(pResourceRecode - resourceDB);

    switch ((resc_name_t)peripheralId)
    {
        case kResc_CodeCache:
            if (operateMode == PM_RESOURCE_OFF)
            {
                 SYSCON->LPCAC_CTRL |= SYSCON_LPCAC_CTRL_DIS_LPCAC_MASK;
            }
            else
            {
                 SYSCON->LPCAC_CTRL &= ~SYSCON_LPCAC_CTRL_DIS_LPCAC_MASK;
            }
            break;

        case kResc_Fro_180M:
            if (operateMode == PM_RESOURCE_OFF)
            {
                if ((SCG0->FIRCCSR & SCG_FIRCCSR_LK_MASK) == SCG_FIRCCSR_LK_MASK)
                {
                    SCG0->FIRCCSR &= ~SCG_FIRCCSR_LK_MASK;
                }

                SCG0->FIRCCSR &= ~SCG_FIRCCSR_FIRC_FCLK_PERIPH_EN_MASK;
                SCG0->FIRCCSR &= ~SCG_FIRCCSR_FIRC_SCLK_PERIPH_EN_MASK;
                SCG0->FIRCCSR |= SCG_FIRCCSR_LK_MASK;
                
                SYSCON->CLOCK_CTRL &= ~SYSCON_CLOCK_CTRL_FRO_HF_ENA_MASK;
            }
            else
            {
                if ((SCG0->FIRCCSR & SCG_FIRCCSR_LK_MASK) == SCG_FIRCCSR_LK_MASK)
                {
                    SCG0->FIRCCSR &= ~SCG_FIRCCSR_LK_MASK;
                }
                
                SYSCON->CLOCK_CTRL |= SYSCON_CLOCK_CTRL_FRO_HF_ENA_MASK;
                SCG0->FIRCCSR |= SCG_FIRCCSR_FIRC_FCLK_PERIPH_EN_MASK;
                SCG0->FIRCCSR |= SCG_FIRCCSR_FIRC_SCLK_PERIPH_EN_MASK;
                
                while ((SCG0->FIRCCSR & SCG_SIRCCSR_SIRCVLD_MASK) == 0U)
                {
                }
                
                SCG0->FIRCCSR |= SCG_FIRCCSR_LK_MASK;
            }
            break;
            
        case kResc_Fro_12M:
            if (operateMode == PM_RESOURCE_OFF)
            {
                if ((SCG0->SIRCCSR & SCG_SIRCCSR_LK_MASK) == SCG_SIRCCSR_LK_MASK)
                {
                    SCG0->SIRCCSR &= ~SCG_SIRCCSR_LK_MASK;
                }

                SCG0->SIRCCSR &= ~SCG_SIRCCSR_SIRC_CLK_PERIPH_EN_MASK;
                SCG0->SIRCCSR |= SCG_SIRCCSR_LK_MASK;
                
                SYSCON->CLOCK_CTRL &= ~SYSCON_CLOCK_CTRL_FRO12MHZ_ENA_MASK;
            }
            else
            {
                if ((SCG0->SIRCCSR & SCG_SIRCCSR_LK_MASK) == SCG_SIRCCSR_LK_MASK)
                {
                    SCG0->SIRCCSR &= ~SCG_SIRCCSR_LK_MASK;
                }
                
                SYSCON->CLOCK_CTRL |= SYSCON_CLOCK_CTRL_FRO12MHZ_ENA_MASK;
                SCG0->SIRCCSR |= SCG_SIRCCSR_SIRC_CLK_PERIPH_EN_MASK;

                while ((SCG0->SIRCCSR & SCG_SIRCCSR_SIRCVLD_MASK) == 0U)
                {
                }
                
                SCG0->SIRCCSR |= SCG_SIRCCSR_LK_MASK;
            }
            break;
            
        case kResc_Fro_16K:
            if (operateMode == PM_RESOURCE_OFF)
            {
                 VBAT_EnableFRO16k(VBAT0, false);
            }
            else
            {
                 VBAT_EnableFRO16k(VBAT0, true);
            }
            break;

        case kResc_Osc_Rtc:
            if (operateMode == PM_RESOURCE_OFF)
            {
                 VBAT_EnableCrystalOsc32k(VBAT0, false);
            }
            else
            {
                 VBAT_EnableCrystalOsc32k(VBAT0, true);
            }
            break;

        case kResc_Osc_Sys:
            if (operateMode == PM_RESOURCE_OFF)
            {
                if ((SCG0->SOSCCSR & SCG_SOSCCSR_LK_MASK) == SCG_SOSCCSR_LK_MASK)
                {
                    SCG0->SOSCCSR &= ~SCG_SOSCCSR_LK_MASK;
                }

                SCG0->SOSCCSR &= ~SCG_SOSCCSR_SOSCEN_MASK;
                SCG0->SOSCCSR |= SCG_SOSCCSR_LK_MASK;
            }
            else
            {
                if ((SCG0->SOSCCSR & SCG_SOSCCSR_LK_MASK) == SCG_SOSCCSR_LK_MASK)
                {
                    SCG0->SOSCCSR &= ~SCG_SOSCCSR_LK_MASK;
                }

                SCG0->SOSCCSR |= SCG_SOSCCSR_SOSCEN_MASK;
                SCG0->SOSCCSR |= SCG_SOSCCSR_LK_MASK;
            }
            break; 

        case kResc_Apll:
            if (operateMode == PM_RESOURCE_OFF)
            {
                if ((SCG0->APLLCSR & SCG_APLLCSR_APLL_LOCK_MASK) == SCG_APLLCSR_APLL_LOCK_MASK)
                {
                    SCG0->APLLCSR &= ~SCG_APLLCSR_APLL_LOCK_MASK;
                }
                
                SCG0->APLLCSR &= ~(SCG_APLLCSR_APLLPWREN_MASK | SCG_APLLCSR_APLLCLKEN_MASK);
                SCG0->APLLCSR |= SCG_APLLCSR_APLL_LOCK_MASK;
            }
            else
            {
                if ((SCG0->APLLCSR & SCG_APLLCSR_APLL_LOCK_MASK) == SCG_APLLCSR_APLL_LOCK_MASK)
                {
                    SCG0->APLLCSR &= ~SCG_APLLCSR_APLL_LOCK_MASK;
                }

                SCG0->APLLCSR |= (SCG_APLLCSR_APLLPWREN_MASK | SCG_APLLCSR_APLLCLKEN_MASK);
                SCG0->APLLCSR |= SCG_APLLCSR_APLL_LOCK_MASK;
            }
            break;

        case kResc_Spll:
            if (operateMode == PM_RESOURCE_OFF)
            {
                if ((SCG0->SPLLCSR & SCG_SPLLCSR_SPLL_LOCK_MASK) == SCG_SPLLCSR_SPLL_LOCK_MASK)
                {
                    SCG0->SPLLCSR &= ~SCG_SPLLCSR_SPLL_LOCK_MASK;
                }
                
                SCG0->SPLLCSR &= ~(SCG_SPLLCSR_SPLLPWREN_MASK | SCG_SPLLCSR_SPLLCLKEN_MASK);
                SCG0->SPLLCSR &= ~SCG_SPLLCSR_SPLL_LOCK_MASK;
            }
            else
            {
                if ((SCG0->SPLLCSR & SCG_SPLLCSR_SPLL_LOCK_MASK) == SCG_SPLLCSR_SPLL_LOCK_MASK)
                {
                    SCG0->SPLLCSR &= ~SCG_SPLLCSR_SPLL_LOCK_MASK;
                }
                
                SCG0->SPLLCSR |= (SCG_SPLLCSR_SPLLPWREN_MASK | SCG_SPLLCSR_SPLLCLKEN_MASK);
                SCG0->SPLLCSR &= ~SCG_SPLLCSR_SPLL_LOCK_MASK;
            }
            break;
            
        default:
        {
            assert(false);
            break;
        }
    }

    pResourceRecode->currentMode = operateMode;
}

static void SetVoltagePeripheralPowerMode(uint8_t operateMode, resource_recode_t *pResourceRecode)
{
    assert(pResourceRecode);

