nxp-mcuxpresso/mcux-component/power_manager/devices/MCXN236/fsl_pm_device.c
    uint8_t peripheralId = (uint8_t)(pResourceRecode - resourceDB);
    
    switch ((resc_name_t)peripheralId)
    {
        case kResc_LdoCore:
            if (operateMode == PM_RESOURCE_OFF)
            {
                 SPC_EnableCoreLDORegulator(SPC0, false);
            }
            else
            {
                 SPC_EnableCoreLDORegulator(SPC0, true);
            }
            break;

        case kResc_RamRetentionLdo:
            if (operateMode == PM_RESOURCE_OFF)
            {
                if (kStatus_Success != VBAT_EnableBackupSRAMRegulator(VBAT0, false))
                {
                    assert(false);
                }
                VBAT_EnableBandgapRefreshMode(VBAT0, false);
                VBAT_EnableBandgap(VBAT0, false);
            }
            else
            {
                VBAT_EnableBandgap(VBAT0, true);
                VBAT_EnableBandgapRefreshMode(VBAT0, true);
                if (kStatus_Success != VBAT_EnableBackupSRAMRegulator(VBAT0, true))
                {
                    assert(false);
                }
            }
            break;

        case kResc_Core_Vdd_Ivs:
            if (operateMode == PM_RESOURCE_OFF)
            {
                SPC_EnableLowPowerModeCoreVDDInternalVoltageScaling(SPC0, false);
            }
            else
            {
                SPC_EnableLowPowerModeCoreVDDInternalVoltageScaling(SPC0, true);
            }
            break;

        case kResc_Core_Vdd_Lvd_Act:
            if (operateMode == PM_RESOURCE_OFF)
            {
                SPC_EnableActiveModeCoreLowVoltageDetect(SPC0, false);
            }
            else
            {
                SPC_EnableActiveModeCoreLowVoltageDetect(SPC0, true);
            }
            break;

        case kResc_Core_Vdd_Hvd_Act:
            if (operateMode == PM_RESOURCE_OFF)
            {
                SPC_EnableActiveModeCoreHighVoltageDetect(SPC0, false);
            }
            else
            {
                SPC_EnableActiveModeCoreHighVoltageDetect(SPC0, true);
            }
            break;

        case kResc_Sys_Vdd_Lvd_Act:
            if (operateMode == PM_RESOURCE_OFF)
            {
                SPC_EnableActiveModeSystemLowVoltageDetect(SPC0, false);
            }
            else
            {
                SPC_EnableActiveModeSystemLowVoltageDetect(SPC0, true);
            }
            break;

        case kResc_Sys_Vdd_Hvd_Act:
            if (operateMode == PM_RESOURCE_OFF)
            {
                SPC_EnableActiveModeSystemHighVoltageDetect(SPC0, false);
            }
            else
            {
                SPC_EnableActiveModeSystemHighVoltageDetect(SPC0, true);
            }
            break;

        case kResc_Io_Vdd_Lvd_Act:
            if (operateMode == PM_RESOURCE_OFF)
            {
                SPC_EnableActiveModeIOLowVoltageDetect(SPC0, false);
            }
            else
            {
                SPC_EnableActiveModeIOLowVoltageDetect(SPC0, true);
            }
            break;

        case kResc_Io_Vdd_Hvd_Act:
            if (operateMode == PM_RESOURCE_OFF)
            {
                SPC_EnableActiveModeIOHighVoltageDetect(SPC0, false);
            }
            else
            {
                SPC_EnableActiveModeIOHighVoltageDetect(SPC0, true);
            }
            break;

        case kResc_Core_Vdd_Lvd_Lp:
            if (operateMode == PM_RESOURCE_OFF)
            {
                SPC_EnableLowPowerModeCoreLowVoltageDetect(SPC0, false);
            }
            else
            {
                SPC_EnableLowPowerModeCoreLowVoltageDetect(SPC0, true);
            }
            break;

        case kResc_Core_Vdd_Hvd_Lp:
            if (operateMode == PM_RESOURCE_OFF)
            {
                SPC_EnableLowPowerModeCoreHighVoltageDetect(SPC0, false);
            }
            else
            {
                SPC_EnableLowPowerModeCoreHighVoltageDetect(SPC0, true);
            }
            break;

        case kResc_Sys_Vdd_Lvd_Lp:
            if (operateMode == PM_RESOURCE_OFF)
            {
                SPC_EnableLowPowerModeSystemLowVoltageDetect(SPC0, false);
            }
            else
            {
                SPC_EnableLowPowerModeSystemLowVoltageDetect(SPC0, true);
            }
            break;

        case kResc_Sys_Vdd_Hvd_Lp:
            if (operateMode == PM_RESOURCE_OFF)
            {
                SPC_EnableLowPowerModeSystemHighVoltageDetect(SPC0, false);
            }
            else
            {
                SPC_EnableLowPowerModeSystemHighVoltageDetect(SPC0, true);
            }
            break;

        case kResc_Io_Vdd_Lvd_Lp:
            if (operateMode == PM_RESOURCE_OFF)
            {
                SPC_EnableLowPowerModeIOLowVoltageDetect(SPC0, false);
            }
            else
            {
                SPC_EnableLowPowerModeIOLowVoltageDetect(SPC0, true);
            }
            break;

        case kResc_Io_Vdd_Hvd_Lp:
            if (operateMode == PM_RESOURCE_OFF)
            {
                SPC_EnableLowPowerModeIOHighVoltageDetect(SPC0, false);
            }
            else
            {
                SPC_EnableLowPowerModeIOHighVoltageDetect(SPC0, true);
            }
            break;
            
        default:
        {
            assert(false);
            break;
        }
    }

    pResourceRecode->currentMode = operateMode;
}

static void SetSramPowerMode(uint8_t operateMode, resource_recode_t *pResourceRecode)
{
    assert(pResourceRecode);

    uint32_t sramId =0U;
    uint8_t peripheralId = (uint8_t)(pResourceRecode - resourceDB);

    if (peripheralId >= (uint8_t)kResc_RamX0)
    {
        sramId = (1U << (uint32_t)(peripheralId - kResc_RamX0));
        
        if (operateMode == PM_RESOURCE_OFF)
        {
            CMC_PowerOffSRAMAllMode(CMC0, sramId | CMC0->SRAMDIS[0]);
        }
        else if (operateMode == PM_RESOURCE_PARTABLE_ON2)
        {
            CMC_PowerOnSRAMAllMode(CMC0, sramId | CMC0->SRAMDIS[0]);
            CMC_PowerOnSRAMLowPowerOnly(CMC0, sramId | CMC0->SRAMRET[0]);
        }
        else
        {
            CMC_PowerOnSRAMAllMode(CMC0, sramId | CMC0->SRAMDIS[0]);
        }
    }
    else
    {
        sramId = (1U << (uint32_t)(peripheralId - kResc_RamA0));
        
        if (operateMode == PM_RESOURCE_OFF)
        {
            VBAT_PowerOffSRAMsInLowPowerModes(VBAT0, (uint8_t)sramId);
        }
        else if (operateMode == PM_RESOURCE_PARTABLE_ON2)
        {
            if (g_nextPowerMode == PM_LP_STATE_DEEP_POWER_DOWN)
            {
                VBAT_RetainSRAMsInLowPowerModes(VBAT0, (uint8_t)sramId);
            }
            else
            {
                VBAT_SwitchSRAMPowerBySocSupply(VBAT0); /* SRAM supply follows the chip power modes. */
            }
        }
        else
        {
            VBAT_SwitchSRAMPowerBySocSupply(VBAT0); /* SRAM supply follows the chip power modes. */
        }
    }

    pResourceRecode->currentMode = operateMode;
}

#if (defined(FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER) && FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER)
static status_t ManageWakeupSource(pm_wakeup_source_t *ws, bool enable)
{
    assert(ws);

    uint32_t inputType;
    uint32_t inputId;
    uint32_t irqn;
    uint32_t misc;

    PM_DECODE_WAKEUP_SOURCE_ID(ws->wsId);

    if (inputType == (uint32_t)kWup_ModInt)
    {
        WUU_SetInternalWakeUpModulesConfig(WUU0, (uint8_t)inputId, kWUU_InternalModuleInterrupt);

        if (enable)
        {
            (void)EnableIRQ((IRQn_Type)irqn);
        }
        else
        {
            (void)DisableIRQ((IRQn_Type)irqn);
        }
    }
    else
    {
        assert(false);
    }
    
    (void)misc;

    return kStatus_Success;
}
#endif /* FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER*/
